ЯМБух.ЯндексМаршрутизация/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4f2c4b13-3dfb-4b87-bc22-07f8e2972770">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЯМ_РежимРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="75e0b3fa-b91c-4e92-ab51-b3bfd40c8670">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="76fa3c69-0377-471a-97ca-44878a98cd8c">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="53de5ae1-60fb-43b8-adfa-305ab44e275e">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0a4155b0-e434-4aee-a802-02e965b39869">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f2e24ed6-5bbb-42d8-b334-7352419f6b14">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЯМБух.ЯндексМаршрутизация/src/CommonModules/РеализацияТоваровУслугФормыКлиент/Module.bsl
&Вместо("ДоставкаНажатие")
Процедура ЯМ_ДоставкаНажатие(Форма, Элемент)
	Объект = Форма.Объект;
	
	Если НЕ Форма.ТолькоПросмотр Тогда
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр",                 Форма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("Организация",                    Объект.Организация);
	ПараметрыФормы.Вставить("Контрагент",                     Объект.Контрагент);
	ПараметрыФормы.Вставить("Грузоотправитель",               Объект.Грузоотправитель);
	ПараметрыФормы.Вставить("Грузополучатель",                Объект.Грузополучатель);
	ПараметрыФормы.Вставить("ДатаДокумента",                  Объект.Дата);
	ПараметрыФормы.Вставить("АдресДоставки",                  Объект.АдресДоставки);
	ПараметрыФормы.Вставить("Перевозчик",                     Объект.Перевозчик);
	ПараметрыФормы.Вставить("МаркаАвтомобиля",                Объект.МаркаАвтомобиля);
	ПараметрыФормы.Вставить("РегистрационныйЗнакАвтомобиля",  Объект.РегистрационныйЗнакАвтомобиля);
	ПараметрыФормы.Вставить("МаркаПрицепа",                   Объект.МаркаПрицепа);
	ПараметрыФормы.Вставить("РегистрационныйЗнакПрицепа",     Объект.РегистрационныйЗнакПрицепа);
	ПараметрыФормы.Вставить("Водитель",                       Объект.Водитель);
	ПараметрыФормы.Вставить("ВодительскоеУдостоверение",      Объект.ВодительскоеУдостоверение);
	ПараметрыФормы.Вставить("КраткоеНаименованиеГруза",       Объект.КраткоеНаименованиеГруза);
	ПараметрыФормы.Вставить("СопроводительныеДокументы",      Объект.СопроводительныеДокументы);
	ПараметрыФормы.Вставить("СведенияОТранспортировкеИГрузе", Объект.СведенияОТранспортировкеИГрузе);
	ПараметрыФормы.Вставить("ПеревозкаАвтотранспортом",       Объект.ПеревозкаАвтотранспортом);
	ПараметрыФормы.Вставить("ЯМ_РежимРаботы",       			Объект.ЯМ_РежимРаботы);
	ПараметрыФормы.Вставить("СпособДоставки",                 Объект.СпособДоставки);
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДоставка", ПараметрыФормы, Форма);
КонецПроцедуры
